{
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "classifier_dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": 0,
  "hidden_act": "gelu",
  "hidden_dropout": 0.0,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "is_decoder": false,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox",
  "num_attention_heads": 4,
  "num_hidden_layers": 6,
  "pad_token_id": null,
  "rope_parameters": {
    "partial_rotary_factor": 0.25,
    "rope_theta": 10000,
    "rope_type": "default"
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.6.2",
  "use_cache": true,
  "use_parallel_residual": true,
  "vocab_size": 50304
}
